In [1]:
print ("Hello")

Hello

In [2]:
import pandas as pd
import numpy as np
%matplotlib inline

In [3]:
grid = [[1,2,3], [4,5,6],[7,8,9]]
print (grid)

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

In [4]:
df = pd.DataFrame(grid)
print(df)

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

In [5]:
import random

array = [[random.randint(0,10) for i in range (3)] for j in range(4)]
print(array)

[[3, 5, 7], [5, 2, 1], [1, 1, 1], [9, 1, 6]]

In [6]:
dfarray = pd.DataFrame(array)
print(dfarray, type(dfarray))

   0  1  2
0  3  5  7
1  5  2  1
2  1  1  1
3  9  1  6 <class 'pandas.core.frame.DataFrame'>

In [7]:
dfarray = pd.DataFrame(array, columns=["one", "two", "three"])
print(dfarray)

   one  two  three
0    3    5      7
1    5    2      1
2    1    1      1
3    9    1      6

In [8]:
print(df[1])

0    2
1    5
2    8
Name: 1, dtype: int64

In [9]:
edges = dfarray[["one", "three"]]
print(edges)

   one  three
0    3      7
1    5      1
2    1      1
3    9      6

In [10]:
print(edges.add(2))

   one  three
0    5      9
1    7      3
2    3      3
3   11      8

In [11]:
print(edges["one"].add(1))

0     4
1     6
2     2
3    10
Name: one, dtype: int64

In [12]:
print(edges["one"] + 1)

0     4
1     6
2     2
3    10
Name: one, dtype: int64

In [13]:
labels = ['First', 'Second', 'Third']
values = [10, 20 ,30]
array = np.arange(10,31,10)
dico = {labels[0]: values[0], labels[1]: values[1], labels[2]: values[2]}
print(labels, values, array, dico)

['First', 'Second', 'Third'] [10, 20, 30] [10 20 30] {'First': 10, 'Second': 20, 'Third': 30}

In [14]:
A = pd.Series(values)
print(A, type(A))

0    10
1    20
2    30
dtype: int64 <class 'pandas.core.series.Series'>

In [15]:
B = pd.Series(values, labels)
B

First     10
Second    20
Third     30
dtype: int64

In [16]:
C = pd.Series(array, labels)
C

First     10
Second    20
Third     30
dtype: int32

In [17]:
D = pd.Series(dico)
D

First     10
Second    20
Third     30
dtype: int64

In [18]:
E = pd.Series(labels, values)
E

10     First
20    Second
30     Third
dtype: object

#

# DataFrames

In [19]:
df = pd.DataFrame([C], ['num'])
df

     First  Second  Third
num     10      20     30

In [20]:
df = pd.DataFrame(B)
df

         0
First   10
Second  20
Third   30

In [21]:
index = 'ONE TWO'.split()
ned_df = pd.DataFrame([B,C], index)
ned_df

     First  Second  Third
ONE     10      20     30
TWO     10      20     30

In [22]:
array = np.arange(1,21).reshape(5,4)
rows = list('ABCDE')
columns = ('odd1 even odd2 even2').split()

dataframe = pd.DataFrame(array, rows, columns, dtype='int')
dataframe

   odd1  even  odd2  even2
A     1     2     3      4
B     5     6     7      8
C     9    10    11     12
D    13    14    15     16
E    17    18    19     20

In [23]:
dataframe['odd1']['A']

1

In [24]:
x = dataframe[['odd1', 'even']]
x['B':'C']

   odd1  even
B     5     6
C     9    10

In [25]:
dataframe[['odd1', 'even']]['B':'C']

   odd1  even
B     5     6
C     9    10

In [26]:
dataframe.loc['A']

odd1     1
even     2
odd2     3
even2    4
Name: A, dtype: int32

In [27]:
dataframe['odd summ'] = dataframe['odd1'] + dataframe['odd2']
dataframe['even summ'] = dataframe['even'] + dataframe['even2']
dataframe

   odd1  even  odd2  even2  odd summ  even summ
A     1     2     3      4         4          6
B     5     6     7      8        12         14
C     9    10    11     12        20         22
D    13    14    15     16        28         30
E    17    18    19     20        36         38

In [28]:
dataframe['disposable'] = np.zeros(5, dtype='float')
dataframe

   odd1  even  odd2  even2  odd summ  even summ  disposable
A     1     2     3      4         4          6         0.0
B     5     6     7      8        12         14         0.0
C     9    10    11     12        20         22         0.0
D    13    14    15     16        28         30         0.0
E    17    18    19     20        36         38         0.0

In [29]:
print(type(np.zeros(5)))
print(np.zeros(5))

<class 'numpy.ndarray'>
[0. 0. 0. 0. 0.]

In [30]:
dataframe.drop('disposable', axis=1, inplace=True)
dataframe

   odd1  even  odd2  even2  odd summ  even summ
A     1     2     3      4         4          6
B     5     6     7      8        12         14
C     9    10    11     12        20         22
D    13    14    15     16        28         30
E    17    18    19     20        36         38

In [31]:
dataframe[['odd summ', 'even summ']][:'A'][dataframe > 4]

   odd summ  even summ
A       NaN          6

In [32]:
dataframe[['odd1', 'even']]

   odd1  even
A     1     2
B     5     6
C     9    10
D    13    14
E    17    18

# Missing Data

In [33]:
dico = {'X': [1,2,np.nan], 'Y': [4, np.nan, np.nan], 'Z': [7, 8, 9]}
dico

{'X': [1, 2, nan], 'Y': [4, nan, nan], 'Z': [7, 8, 9]}

In [34]:
row_labels = ['A', 'B', 'C']
df = pd.DataFrame(dico, row_labels)
df

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8
C  NaN  NaN  9

## dropna()

In [35]:
df.dropna()

     X    Y  Z
A  1.0  4.0  7

In [36]:
df.dropna(axis=1)

   Z
A  7
B  8
C  9

In [37]:
df.dropna(thresh=2)

     X    Y  Z
A  1.0  4.0  7
B  2.0  NaN  8

In [38]:
df.dropna(axis=1, thresh=2)

     X  Z
A  1.0  7
B  2.0  8
C  NaN  9

## fillna()

In [39]:
df.fillna('fuck', limit=1)

      X     Y  Z
A     1     4  7
B     2  fuck  8
C  fuck   NaN  9

In [40]:
for i in list('XYZ'):
    df[i].fillna(value=df[i].mean(), inplace=True)
df

     X    Y  Z
A  1.0  4.0  7
B  2.0  4.0  8
C  1.5  4.0  9

## replace()

In [41]:
array = np.arange(1,21).reshape(5,4)
rows = list('ABCDE')
columns = ('odd1 even odd2 even2').split()

dataframe = pd.DataFrame(array, columns = columns, index=rows, dtype='int')

dataframe.loc['A'].replace([1,2,3], ['a', 'b', 'c'])

odd1     a
even     b
odd2     c
even2    4
Name: A, dtype: object

In [42]:
array = np.arange(1,21).reshape(5,4)
rows = list('ABCDE')
columns = ('odd1 even odd2 even2').split()

dataframe = pd.DataFrame(array, columns = columns, index=rows, dtype='int')

dataframe.loc['A'].replace(1, np.nan)

odd1     NaN
even     2.0
odd2     3.0
even2    4.0
Name: A, dtype: float64

## Group by()

In [43]:
data = {'Sales person': 'Sam Charley Ammy Vanessa Carl Sarah'.split(),
       'Product': 'HP HP DELL APPLE APPLE LENOVO'.split(),
       'Sales': [200, 150, 340, 124, 234, 350]}
index = list(range(1,7))
df = pd.DataFrame(data, index)
df

  Sales person Product  Sales
1          Sam      HP    200
2      Charley      HP    150
3         Ammy    DELL    340
4      Vanessa   APPLE    124
5         Carl   APPLE    234
6        Sarah  LENOVO    350

In [44]:
df.groupby('Product').sum()

         Sales
Product
APPLE      358
DELL       340
HP         350
LENOVO     350

In [45]:
df.groupby('Product').count()

         Sales person  Sales
Product
APPLE               2      2
DELL                1      1
HP                  2      2
LENOVO              1      1

In [47]:
df.groupby('Product').describe()

        Sales
        count   mean        std    min    25%    50%    75%    max
Product
APPLE     2.0  179.0  77.781746  124.0  151.5  179.0  206.5  234.0
DELL      1.0  340.0        NaN  340.0  340.0  340.0  340.0  340.0
HP        2.0  175.0  35.355339  150.0  162.5  175.0  187.5  200.0
LENOVO    1.0  350.0        NaN  350.0  350.0  350.0  350.0  350.0

## Contacenate, merge and join

In [138]:
d1 = {'A': 'A1 A2 A3'.split(), 'B': 'B1 B2 B3'.split(), 'C': 'C1 C2 C3'.split()}
d2 = {'A': 'A4 A5 A6'.split(), 'B': 'B4 B5 B6'.split(), 'C': 'C4 C5 C6'.split()}

In [139]:
df1 = pd.DataFrame(d1, index = list('123'))
df2 = pd.DataFrame(d2, index = list('456'))
print(f'{df1}\n{df2}')

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
    A   B   C
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

In [134]:
pd.concat([df1, df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6

In [94]:
pd.concat([df1, df2])[['A', 'B']][:3]

    A   B
1  A1  B1
2  A2  B2
3  A3  B3

In [133]:
pd.concat([df1, df2], axis=1, sort=True)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4  NaN  NaN  NaN   A4   B4   C4
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6

In [137]:
df3 = pd.DataFrame(d2, index=list('123'))

In [142]:
df3.columns='D E F'.split()
pd.concat([df1, df3], axis=1)

    A   B   C   D   E   F
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5
3  A3  B3  C3  A6  B6  C6

## reading and writing data

In [144]:
pwd()

'C:\\Users\\tbb76'

In [147]:
import os
os.chdir('Z:\\Downloads')

In [148]:
pwd()

'Z:\\Downloads'

In [155]:
csv_data = pd.read_csv('Salaries.csv')

Z:\anaconda3\lib\site-packages\IPython\core\interactiveshell.py:3063: DtypeWarning: Columns (3,4,5,6,12) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [158]:
csv_data.head()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
0,1,NATHANIEL FORD,GENERAL MANAGER-METROPOLITAN TRANSIT AUTHORITY,167411,0,400184,NaN,567595.43,567595.43,2011,NaN,San Francisco,NaN
1,2,GARY JIMENEZ,CAPTAIN III (POLICE DEPARTMENT),155966,245132,137811,NaN,538909.28,538909.28,2011,NaN,San Francisco,NaN
2,3,ALBERT PARDINI,CAPTAIN III (POLICE DEPARTMENT),212739,106088,16452.6,NaN,335279.91,335279.91,2011,NaN,San Francisco,NaN
3,4,CHRISTOPHER CHONG,WIRE ROPE CABLE MAINTENANCE MECHANIC,77916,56120.7,198307,NaN,332343.61,332343.61,2011,NaN,San Francisco,NaN
4,5,PATRICK GARDNER,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",134402,9737,182235,NaN,326373.19,326373.19,2011,NaN,San Francisco,NaN

In [160]:
csv_data.tail()

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
148649,148650,Roy I Tillery,Custodian,0.00,0.00,0.00,0.00,0.00,0.00,2014,NaN,San Francisco,PT
148650,148651,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148651,148652,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148652,148653,Not provided,Not provided,Not Provided,Not Provided,Not Provided,Not Provided,0.00,0.00,2014,NaN,San Francisco,NaN
148653,148654,Joe Lopez,"Counselor, Log Cabin Ranch",0.00,0.00,-618.13,0.00,-618.13,-618.13,2014,NaN,San Francisco,PT

In [164]:
csv_data['TotalPayBenefits'].max()

567595.43

In [173]:
csv_data[csv_data['EmployeeName'] == 'MONICA FIELDS']

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
29,30,MONICA FIELDS,"DEPUTY CHIEF OF DEPARTMENT,(FIRE DEPARTMENT)",246226,0,15140.5,NaN,261366.14,261366.14,2011,NaN,San Francisco,NaN

In [196]:
max_base = csv_data['BasePay'].replace('Not Provided', np.nan).astype('float').max()

319275.01

In [197]:
csv_data[csv_data['BasePay'] == 319275.01]

,Id,EmployeeName,JobTitle,BasePay,OvertimePay,OtherPay,Benefits,TotalPay,TotalPayBenefits,Year,Notes,Agency,Status
72925,72926,Gregory P Suhr,Chief of Police,319275,0,20007.1,86533.2,339282.07,425815.28,2013,NaN,San Francisco,NaN